backend: tensorflow
class_name: Model
config:
  input_layers:
  - [input_7, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 768, 512, 3]
      dtype: float32
      name: input_7
      sparse: false
    inbound_nodes: []
    name: input_7
  - class_name: Model
    config:
      input_layers:
      - [input_8, 0, 0]
      layers:
      - class_name: InputLayer
        config:
          batch_input_shape: !!python/tuple [null, null, null, 3]
          dtype: float32
          name: input_8
          sparse: false
        inbound_nodes: []
        name: input_8
      - class_name: Conv2D
        config:
          activation: relu
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {dtype: float32}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: !!python/tuple [1, 1]
          dtype: float32
          filters: 64
          kernel_constraint: null
          kernel_initializer:
            class_name: GlorotUniform
            config: {dtype: float32, seed: null}
          kernel_regularizer: null
          kernel_size: !!python/tuple [3, 3]
          name: block1_conv1
          padding: same
          strides: !!python/tuple [1, 1]
          trainable: true
          use_bias: true
        inbound_nodes:
        - - - input_8
            - 0
            - 0
            - {}
        name: block1_conv1
      - class_name: Conv2D
        config:
          activation: relu
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {dtype: float32}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: !!python/tuple [1, 1]
          dtype: float32
          filters: 64
          kernel_constraint: null
          kernel_initializer:
            class_name: GlorotUniform
            config: {dtype: float32, seed: null}
          kernel_regularizer: null
          kernel_size: !!python/tuple [3, 3]
          name: block1_conv2
          padding: same
          strides: !!python/tuple [1, 1]
          trainable: true
          use_bias: true
        inbound_nodes:
        - - - block1_conv1
            - 0
            - 0
            - {}
        name: block1_conv2
      - class_name: MaxPooling2D
        config:
          data_format: channels_last
          dtype: float32
          name: block1_pool
          padding: valid
          pool_size: !!python/tuple [2, 2]
          strides: !!python/tuple [2, 2]
          trainable: true
        inbound_nodes:
        - - - block1_conv2
            - 0
            - 0
            - {}
        name: block1_pool
      - class_name: Conv2D
        config:
          activation: relu
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {dtype: float32}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: !!python/tuple [1, 1]
          dtype: float32
          filters: 128
          kernel_constraint: null
          kernel_initializer:
            class_name: GlorotUniform
            config: {dtype: float32, seed: null}
          kernel_regularizer: null
          kernel_size: !!python/tuple [3, 3]
          name: block2_conv1
          padding: same
          strides: !!python/tuple [1, 1]
          trainable: true
          use_bias: true
        inbound_nodes:
        - - - block1_pool
            - 0
            - 0
            - {}
        name: block2_conv1
      - class_name: Conv2D
        config:
          activation: relu
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {dtype: float32}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: !!python/tuple [1, 1]
          dtype: float32
          filters: 128
          kernel_constraint: null
          kernel_initializer:
            class_name: GlorotUniform
            config: {dtype: float32, seed: null}
          kernel_regularizer: null
          kernel_size: !!python/tuple [3, 3]
          name: block2_conv2
          padding: same
          strides: !!python/tuple [1, 1]
          trainable: true
          use_bias: true
        inbound_nodes:
        - - - block2_conv1
            - 0
            - 0
            - {}
        name: block2_conv2
      - class_name: MaxPooling2D
        config:
          data_format: channels_last
          dtype: float32
          name: block2_pool
          padding: valid
          pool_size: !!python/tuple [2, 2]
          strides: !!python/tuple [2, 2]
          trainable: true
        inbound_nodes:
        - - - block2_conv2
            - 0
            - 0
            - {}
        name: block2_pool
      - class_name: Conv2D
        config:
          activation: relu
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {dtype: float32}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: !!python/tuple [1, 1]
          dtype: float32
          filters: 256
          kernel_constraint: null
          kernel_initializer:
            class_name: GlorotUniform
            config: {dtype: float32, seed: null}
          kernel_regularizer: null
          kernel_size: !!python/tuple [3, 3]
          name: block3_conv1
          padding: same
          strides: !!python/tuple [1, 1]
          trainable: true
          use_bias: true
        inbound_nodes:
        - - - block2_pool
            - 0
            - 0
            - {}
        name: block3_conv1
      - class_name: Conv2D
        config:
          activation: relu
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {dtype: float32}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: !!python/tuple [1, 1]
          dtype: float32
          filters: 256
          kernel_constraint: null
          kernel_initializer:
            class_name: GlorotUniform
            config: {dtype: float32, seed: null}
          kernel_regularizer: null
          kernel_size: !!python/tuple [3, 3]
          name: block3_conv2
          padding: same
          strides: !!python/tuple [1, 1]
          trainable: true
          use_bias: true
        inbound_nodes:
        - - - block3_conv1
            - 0
            - 0
            - {}
        name: block3_conv2
      - class_name: Conv2D
        config:
          activation: relu
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {dtype: float32}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: !!python/tuple [1, 1]
          dtype: float32
          filters: 256
          kernel_constraint: null
          kernel_initializer:
            class_name: GlorotUniform
            config: {dtype: float32, seed: null}
          kernel_regularizer: null
          kernel_size: !!python/tuple [3, 3]
          name: block3_conv3
          padding: same
          strides: !!python/tuple [1, 1]
          trainable: true
          use_bias: true
        inbound_nodes:
        - - - block3_conv2
            - 0
            - 0
            - {}
        name: block3_conv3
      - class_name: MaxPooling2D
        config:
          data_format: channels_last
          dtype: float32
          name: block3_pool
          padding: valid
          pool_size: !!python/tuple [2, 2]
          strides: !!python/tuple [2, 2]
          trainable: true
        inbound_nodes:
        - - - block3_conv3
            - 0
            - 0
            - {}
        name: block3_pool
      - class_name: Conv2D
        config:
          activation: relu
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {dtype: float32}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: !!python/tuple [1, 1]
          dtype: float32
          filters: 512
          kernel_constraint: null
          kernel_initializer:
            class_name: GlorotUniform
            config: {dtype: float32, seed: null}
          kernel_regularizer: null
          kernel_size: !!python/tuple [3, 3]
          name: block4_conv1
          padding: same
          strides: !!python/tuple [1, 1]
          trainable: true
          use_bias: true
        inbound_nodes:
        - - - block3_pool
            - 0
            - 0
            - {}
        name: block4_conv1
      - class_name: Conv2D
        config:
          activation: relu
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {dtype: float32}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: !!python/tuple [1, 1]
          dtype: float32
          filters: 512
          kernel_constraint: null
          kernel_initializer:
            class_name: GlorotUniform
            config: {dtype: float32, seed: null}
          kernel_regularizer: null
          kernel_size: !!python/tuple [3, 3]
          name: block4_conv2
          padding: same
          strides: !!python/tuple [1, 1]
          trainable: true
          use_bias: true
        inbound_nodes:
        - - - block4_conv1
            - 0
            - 0
            - {}
        name: block4_conv2
      - class_name: Conv2D
        config:
          activation: relu
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {dtype: float32}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: !!python/tuple [1, 1]
          dtype: float32
          filters: 512
          kernel_constraint: null
          kernel_initializer:
            class_name: GlorotUniform
            config: {dtype: float32, seed: null}
          kernel_regularizer: null
          kernel_size: !!python/tuple [3, 3]
          name: block4_conv3
          padding: same
          strides: !!python/tuple [1, 1]
          trainable: true
          use_bias: true
        inbound_nodes:
        - - - block4_conv2
            - 0
            - 0
            - {}
        name: block4_conv3
      - class_name: MaxPooling2D
        config:
          data_format: channels_last
          dtype: float32
          name: block4_pool
          padding: valid
          pool_size: !!python/tuple [2, 2]
          strides: !!python/tuple [2, 2]
          trainable: true
        inbound_nodes:
        - - - block4_conv3
            - 0
            - 0
            - {}
        name: block4_pool
      - class_name: Conv2D
        config:
          activation: relu
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {dtype: float32}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: !!python/tuple [1, 1]
          dtype: float32
          filters: 512
          kernel_constraint: null
          kernel_initializer:
            class_name: GlorotUniform
            config: {dtype: float32, seed: null}
          kernel_regularizer: null
          kernel_size: !!python/tuple [3, 3]
          name: block5_conv1
          padding: same
          strides: !!python/tuple [1, 1]
          trainable: true
          use_bias: true
        inbound_nodes:
        - - - block4_pool
            - 0
            - 0
            - {}
        name: block5_conv1
      - class_name: Conv2D
        config:
          activation: relu
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {dtype: float32}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: !!python/tuple [1, 1]
          dtype: float32
          filters: 512
          kernel_constraint: null
          kernel_initializer:
            class_name: GlorotUniform
            config: {dtype: float32, seed: null}
          kernel_regularizer: null
          kernel_size: !!python/tuple [3, 3]
          name: block5_conv2
          padding: same
          strides: !!python/tuple [1, 1]
          trainable: true
          use_bias: true
        inbound_nodes:
        - - - block5_conv1
            - 0
            - 0
            - {}
        name: block5_conv2
      - class_name: Conv2D
        config:
          activation: relu
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {dtype: float32}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: !!python/tuple [1, 1]
          dtype: float32
          filters: 512
          kernel_constraint: null
          kernel_initializer:
            class_name: GlorotUniform
            config: {dtype: float32, seed: null}
          kernel_regularizer: null
          kernel_size: !!python/tuple [3, 3]
          name: block5_conv3
          padding: same
          strides: !!python/tuple [1, 1]
          trainable: true
          use_bias: true
        inbound_nodes:
        - - - block5_conv2
            - 0
            - 0
            - {}
        name: block5_conv3
      - class_name: MaxPooling2D
        config:
          data_format: channels_last
          dtype: float32
          name: block5_pool
          padding: valid
          pool_size: !!python/tuple [2, 2]
          strides: !!python/tuple [2, 2]
          trainable: true
        inbound_nodes:
        - - - block5_conv3
            - 0
            - 0
            - {}
        name: block5_pool
      name: model_9
      output_layers:
      - [block1_pool, 0, 0]
      - [block2_pool, 0, 0]
      - [block3_pool, 0, 0]
      - [block4_pool, 0, 0]
      - [block5_pool, 0, 0]
    inbound_nodes:
    - - - input_7
        - 0
        - 0
        - {}
    name: model_9
  - class_name: Conv2DTranspose
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {dtype: float32}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple [1, 1]
      dtype: float32
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config: {dtype: float32, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [2, 2]
      name: conv2d_transpose_15
      padding: same
      strides: !!python/tuple [2, 2]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - model_9
        - 1
        - 4
        - {}
    name: conv2d_transpose_15
  - class_name: Concatenate
    config: {axis: -1, dtype: float32, name: concatenate_12, trainable: true}
    inbound_nodes:
    - - - model_9
        - 1
        - 3
        - &id001 {}
      - - conv2d_transpose_15
        - 0
        - 0
        - *id001
    name: concatenate_12
  - class_name: Activation
    config: {activation: relu, dtype: float32, name: activation_45, trainable: true}
    inbound_nodes:
    - - - concatenate_12
        - 0
        - 0
        - {}
    name: activation_45
  - class_name: BatchNormalization
    config:
      axis: [3]
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {dtype: float32}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {dtype: float32}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {dtype: float32}
      moving_variance_initializer:
        class_name: Ones
        config: {dtype: float32}
      name: batch_normalization_45
      scale: true
      trainable: true
    inbound_nodes:
    - - - activation_45
        - 0
        - 0
        - {}
    name: batch_normalization_45
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {dtype: float32}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple [1, 1]
      dtype: float32
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config: {dtype: float32, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_33
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - batch_normalization_45
        - 0
        - 0
        - {}
    name: conv2d_33
  - class_name: Activation
    config: {activation: relu, dtype: float32, name: activation_46, trainable: true}
    inbound_nodes:
    - - - conv2d_33
        - 0
        - 0
        - {}
    name: activation_46
  - class_name: BatchNormalization
    config:
      axis: [3]
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {dtype: float32}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {dtype: float32}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {dtype: float32}
      moving_variance_initializer:
        class_name: Ones
        config: {dtype: float32}
      name: batch_normalization_46
      scale: true
      trainable: true
    inbound_nodes:
    - - - activation_46
        - 0
        - 0
        - {}
    name: batch_normalization_46
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {dtype: float32}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple [1, 1]
      dtype: float32
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config: {dtype: float32, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0010000000474974513}
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_34
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - batch_normalization_46
        - 0
        - 0
        - {}
    name: conv2d_34
  - class_name: Activation
    config: {activation: relu, dtype: float32, name: activation_47, trainable: true}
    inbound_nodes:
    - - - conv2d_34
        - 0
        - 0
        - {}
    name: activation_47
  - class_name: BatchNormalization
    config:
      axis: [3]
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {dtype: float32}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {dtype: float32}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {dtype: float32}
      moving_variance_initializer:
        class_name: Ones
        config: {dtype: float32}
      name: batch_normalization_47
      scale: true
      trainable: true
    inbound_nodes:
    - - - activation_47
        - 0
        - 0
        - {}
    name: batch_normalization_47
  - class_name: Conv2DTranspose
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {dtype: float32}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple [1, 1]
      dtype: float32
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config: {dtype: float32, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [2, 2]
      name: conv2d_transpose_16
      padding: same
      strides: !!python/tuple [2, 2]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - batch_normalization_47
        - 0
        - 0
        - {}
    name: conv2d_transpose_16
  - class_name: Concatenate
    config: {axis: -1, dtype: float32, name: concatenate_13, trainable: true}
    inbound_nodes:
    - - - model_9
        - 1
        - 2
        - &id002 {}
      - - conv2d_transpose_16
        - 0
        - 0
        - *id002
    name: concatenate_13
  - class_name: Activation
    config: {activation: relu, dtype: float32, name: activation_48, trainable: true}
    inbound_nodes:
    - - - concatenate_13
        - 0
        - 0
        - {}
    name: activation_48
  - class_name: BatchNormalization
    config:
      axis: [3]
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {dtype: float32}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {dtype: float32}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {dtype: float32}
      moving_variance_initializer:
        class_name: Ones
        config: {dtype: float32}
      name: batch_normalization_48
      scale: true
      trainable: true
    inbound_nodes:
    - - - activation_48
        - 0
        - 0
        - {}
    name: batch_normalization_48
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {dtype: float32}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple [1, 1]
      dtype: float32
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config: {dtype: float32, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_35
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - batch_normalization_48
        - 0
        - 0
        - {}
    name: conv2d_35
  - class_name: Activation
    config: {activation: relu, dtype: float32, name: activation_49, trainable: true}
    inbound_nodes:
    - - - conv2d_35
        - 0
        - 0
        - {}
    name: activation_49
  - class_name: BatchNormalization
    config:
      axis: [3]
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {dtype: float32}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {dtype: float32}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {dtype: float32}
      moving_variance_initializer:
        class_name: Ones
        config: {dtype: float32}
      name: batch_normalization_49
      scale: true
      trainable: true
    inbound_nodes:
    - - - activation_49
        - 0
        - 0
        - {}
    name: batch_normalization_49
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {dtype: float32}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple [1, 1]
      dtype: float32
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config: {dtype: float32, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0010000000474974513}
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_36
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - batch_normalization_49
        - 0
        - 0
        - {}
    name: conv2d_36
  - class_name: Activation
    config: {activation: relu, dtype: float32, name: activation_50, trainable: true}
    inbound_nodes:
    - - - conv2d_36
        - 0
        - 0
        - {}
    name: activation_50
  - class_name: BatchNormalization
    config:
      axis: [3]
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {dtype: float32}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {dtype: float32}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {dtype: float32}
      moving_variance_initializer:
        class_name: Ones
        config: {dtype: float32}
      name: batch_normalization_50
      scale: true
      trainable: true
    inbound_nodes:
    - - - activation_50
        - 0
        - 0
        - {}
    name: batch_normalization_50
  - class_name: Conv2DTranspose
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {dtype: float32}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple [1, 1]
      dtype: float32
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config: {dtype: float32, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [2, 2]
      name: conv2d_transpose_17
      padding: same
      strides: !!python/tuple [2, 2]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - batch_normalization_50
        - 0
        - 0
        - {}
    name: conv2d_transpose_17
  - class_name: Concatenate
    config: {axis: -1, dtype: float32, name: concatenate_14, trainable: true}
    inbound_nodes:
    - - - model_9
        - 1
        - 1
        - &id003 {}
      - - conv2d_transpose_17
        - 0
        - 0
        - *id003
    name: concatenate_14
  - class_name: Activation
    config: {activation: relu, dtype: float32, name: activation_51, trainable: true}
    inbound_nodes:
    - - - concatenate_14
        - 0
        - 0
        - {}
    name: activation_51
  - class_name: BatchNormalization
    config:
      axis: [3]
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {dtype: float32}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {dtype: float32}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {dtype: float32}
      moving_variance_initializer:
        class_name: Ones
        config: {dtype: float32}
      name: batch_normalization_51
      scale: true
      trainable: true
    inbound_nodes:
    - - - activation_51
        - 0
        - 0
        - {}
    name: batch_normalization_51
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {dtype: float32}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple [1, 1]
      dtype: float32
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config: {dtype: float32, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_37
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - batch_normalization_51
        - 0
        - 0
        - {}
    name: conv2d_37
  - class_name: Activation
    config: {activation: relu, dtype: float32, name: activation_52, trainable: true}
    inbound_nodes:
    - - - conv2d_37
        - 0
        - 0
        - {}
    name: activation_52
  - class_name: BatchNormalization
    config:
      axis: [3]
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {dtype: float32}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {dtype: float32}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {dtype: float32}
      moving_variance_initializer:
        class_name: Ones
        config: {dtype: float32}
      name: batch_normalization_52
      scale: true
      trainable: true
    inbound_nodes:
    - - - activation_52
        - 0
        - 0
        - {}
    name: batch_normalization_52
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {dtype: float32}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple [1, 1]
      dtype: float32
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config: {dtype: float32, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0010000000474974513}
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_38
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - batch_normalization_52
        - 0
        - 0
        - {}
    name: conv2d_38
  - class_name: Activation
    config: {activation: relu, dtype: float32, name: activation_53, trainable: true}
    inbound_nodes:
    - - - conv2d_38
        - 0
        - 0
        - {}
    name: activation_53
  - class_name: BatchNormalization
    config:
      axis: [3]
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {dtype: float32}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {dtype: float32}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {dtype: float32}
      moving_variance_initializer:
        class_name: Ones
        config: {dtype: float32}
      name: batch_normalization_53
      scale: true
      trainable: true
    inbound_nodes:
    - - - activation_53
        - 0
        - 0
        - {}
    name: batch_normalization_53
  - class_name: Conv2DTranspose
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {dtype: float32}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple [1, 1]
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config: {dtype: float32, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [2, 2]
      name: conv2d_transpose_18
      padding: same
      strides: !!python/tuple [2, 2]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - batch_normalization_53
        - 0
        - 0
        - {}
    name: conv2d_transpose_18
  - class_name: Concatenate
    config: {axis: -1, dtype: float32, name: concatenate_15, trainable: true}
    inbound_nodes:
    - - - model_9
        - 1
        - 0
        - &id004 {}
      - - conv2d_transpose_18
        - 0
        - 0
        - *id004
    name: concatenate_15
  - class_name: Activation
    config: {activation: relu, dtype: float32, name: activation_54, trainable: true}
    inbound_nodes:
    - - - concatenate_15
        - 0
        - 0
        - {}
    name: activation_54
  - class_name: BatchNormalization
    config:
      axis: [3]
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {dtype: float32}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {dtype: float32}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {dtype: float32}
      moving_variance_initializer:
        class_name: Ones
        config: {dtype: float32}
      name: batch_normalization_54
      scale: true
      trainable: true
    inbound_nodes:
    - - - activation_54
        - 0
        - 0
        - {}
    name: batch_normalization_54
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {dtype: float32}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple [1, 1]
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config: {dtype: float32, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_39
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - batch_normalization_54
        - 0
        - 0
        - {}
    name: conv2d_39
  - class_name: Activation
    config: {activation: relu, dtype: float32, name: activation_55, trainable: true}
    inbound_nodes:
    - - - conv2d_39
        - 0
        - 0
        - {}
    name: activation_55
  - class_name: BatchNormalization
    config:
      axis: [3]
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {dtype: float32}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {dtype: float32}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {dtype: float32}
      moving_variance_initializer:
        class_name: Ones
        config: {dtype: float32}
      name: batch_normalization_55
      scale: true
      trainable: true
    inbound_nodes:
    - - - activation_55
        - 0
        - 0
        - {}
    name: batch_normalization_55
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {dtype: float32}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple [1, 1]
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config: {dtype: float32, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0010000000474974513}
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_40
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - batch_normalization_55
        - 0
        - 0
        - {}
    name: conv2d_40
  - class_name: Activation
    config: {activation: relu, dtype: float32, name: activation_56, trainable: true}
    inbound_nodes:
    - - - conv2d_40
        - 0
        - 0
        - {}
    name: activation_56
  - class_name: BatchNormalization
    config:
      axis: [3]
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {dtype: float32}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {dtype: float32}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {dtype: float32}
      moving_variance_initializer:
        class_name: Ones
        config: {dtype: float32}
      name: batch_normalization_56
      scale: true
      trainable: true
    inbound_nodes:
    - - - activation_56
        - 0
        - 0
        - {}
    name: batch_normalization_56
  - class_name: Conv2DTranspose
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {dtype: float32}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple [1, 1]
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config: {dtype: float32, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [2, 2]
      name: conv2d_transpose_19
      padding: same
      strides: !!python/tuple [2, 2]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - batch_normalization_56
        - 0
        - 0
        - {}
    name: conv2d_transpose_19
  - class_name: Activation
    config: {activation: relu, dtype: float32, name: activation_57, trainable: true}
    inbound_nodes:
    - - - conv2d_transpose_19
        - 0
        - 0
        - {}
    name: activation_57
  - class_name: BatchNormalization
    config:
      axis: [3]
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {dtype: float32}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {dtype: float32}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {dtype: float32}
      moving_variance_initializer:
        class_name: Ones
        config: {dtype: float32}
      name: batch_normalization_57
      scale: true
      trainable: true
    inbound_nodes:
    - - - activation_57
        - 0
        - 0
        - {}
    name: batch_normalization_57
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {dtype: float32}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple [1, 1]
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config: {dtype: float32, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_41
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - batch_normalization_57
        - 0
        - 0
        - {}
    name: conv2d_41
  - class_name: Activation
    config: {activation: relu, dtype: float32, name: activation_58, trainable: true}
    inbound_nodes:
    - - - conv2d_41
        - 0
        - 0
        - {}
    name: activation_58
  - class_name: BatchNormalization
    config:
      axis: [3]
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {dtype: float32}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {dtype: float32}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {dtype: float32}
      moving_variance_initializer:
        class_name: Ones
        config: {dtype: float32}
      name: batch_normalization_58
      scale: true
      trainable: true
    inbound_nodes:
    - - - activation_58
        - 0
        - 0
        - {}
    name: batch_normalization_58
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {dtype: float32}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple [1, 1]
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config: {dtype: float32, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.0010000000474974513}
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_42
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - batch_normalization_58
        - 0
        - 0
        - {}
    name: conv2d_42
  - class_name: Activation
    config: {activation: relu, dtype: float32, name: activation_59, trainable: true}
    inbound_nodes:
    - - - conv2d_42
        - 0
        - 0
        - {}
    name: activation_59
  - class_name: BatchNormalization
    config:
      axis: [3]
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {dtype: float32}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {dtype: float32}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {dtype: float32}
      moving_variance_initializer:
        class_name: Ones
        config: {dtype: float32}
      name: batch_normalization_59
      scale: true
      trainable: true
    inbound_nodes:
    - - - activation_59
        - 0
        - 0
        - {}
    name: batch_normalization_59
  - class_name: Conv2D
    config:
      activation: sigmoid
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {dtype: float32}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple [1, 1]
      dtype: float32
      filters: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config: {dtype: float32, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_43
      padding: valid
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - batch_normalization_59
        - 0
        - 0
        - {}
    name: conv2d_43
  name: model_10
  output_layers:
  - [conv2d_43, 0, 0]
keras_version: 2.1.6-tf
